Creating and accessing data frame elements

In [2]:
import pandas as pd
name = ["Indu","Siva","Kiran","Deepak","chowman","Rob","Bob","Kim","Satya","Hillman"]
age = [20,25,23,45,22,31,43,56,65,89]
idNum = [1001,1002,1003,1004,1005,1006,1007,1008,1009,1010]
dict1 = {
    'Name' : name,
    "age" : age,
    "idNum" : idNum
}

df = pd.DataFrame(dict1)
df

      Name  age  idNum
0     Indu   20   1001
1     Siva   25   1002
2    Kiran   23   1003
3   Deepak   45   1004
4  chowman   22   1005
5      Rob   31   1006
6      Bob   43   1007
7      Kim   56   1008
8    Satya   65   1009
9  Hillman   89   1010

In [5]:
#access 3rd element 
df[2:3]

    Name  age  idNum
2  Kiran   23   1003

In [6]:
#access 4th element
df[4:5]

      Name  age  idNum
4  chowman   22   1005

In [7]:
#access last 6 values
df[-6:]

      Name  age  idNum
4  chowman   22   1005
5      Rob   31   1006
6      Bob   43   1007
7      Kim   56   1008
8    Satya   65   1009
9  Hillman   89   1010